# GetInsulationLiningGeometry Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..GetInsulationLiningGeometry Method
FabricationPart Class See Also
---
Gets insulation and lining geometry for this fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public GeometryElement GetInsulationLiningGeometry()
```

Visual Basic
---
```text
Public Function GetInsulationLiningGeometry As GeometryElement
```

Visual C++
---
```text
public:
GeometryElement^ GetInsulationLiningGeometry()
```

# ### Return Value
Returns any insulation and liner geometry.
# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace